{"config": {"layers": [{"config": {"activation": "relu", "dilation_rate": [1, 1], "use_bias": true, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "batch_input_shape": [null, 28, 28, 1], "name": "conv2d", "filters": 16, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "data_format": "channels_last", "dtype": "float32", "kernel_constraint": null, "kernel_size": [3, 3], "bias_constraint": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "dtype": "float32", "trainable": true, "padding": "same", "pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d"}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.5, "dtype": "float32", "trainable": true, "noise_shape": null, "seed": null, "name": "dropout"}, "class_name": "Dropout"}, {"config": {"dtype": "float32", "trainable": true, "data_format": "channels_last", "name": "flatten"}, "class_name": "Flatten"}, {"config": {"dtype": "float32", "kernel_constraint": null, "bias_regularizer": null, "activation": "softmax", "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "use_bias": true, "units": 10, "name": "dense", "bias_constraint": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotNormal"}}, "class_name": "Dense"}], "name": "sequential"}, "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.4-tf"}